<template>
	<view>
		<view class="header">
			<status-bar></status-bar>
			<view class="page-header">
				<view class="back" @click="goBack"><image :src="getStaticFilePath('@/static/common/back.png')" class="icon"></image></view>
				<view class="title"><text class="text">服务协议</text></view>
			</view>
		</view>
		<view class="header-holder" :style="'height:' + (holderHeight + 36)*2 + 'rpx;'"></view>
		<view class="content">
			<text class="title">用户协议</text>
			<text>《用户协议》（以下简称“协议”）是由您（用户）与火潮星球平台（以下简称“平台”）所有权方深圳红兔文化传媒有限公司 （以下简称‘“我们”或“火潮星球”）就我们向您提供数字藏品浏览、购买等服务（以下简称“本服务”）所订立的有效合约。请您先仔细阅读本协议内容，针对限制、免除条款或其他涉及您重大权益的条款将会以加粗、加下划线等形式提示您重点注意如果您对本协议内容或页面提示信息有任何疑问，请勿进行下一步操作，可以通过邮箱：【758107617@qq.com】与我们取得联系，以便我们为您解释或说明。</text>
			<text>第一条 特别提示</text>
			<text>1.1、深圳红兔文化传媒有限公司在此特别提醒您在注册成为火潮星球用户之前，请您仔细阅读本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款，井审慎选择接受或不接受本协议。除非您接受本协议所有条款，否则您无法注册、登录或使用本协议所涉服务。您的注册、点击确认、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。</text>
			<text>1.2、为进一步改善用户体验，我们将联合我们的关联方和/或合作方持续更新服务，包括但不限于版本升级、功能升级、技术升级、新增、更新或调整服务内容和功能，本协议可能会随之更新，我们也会根据国家法律法规的变化要求，更新本协议的相关条款。关于本条包含的更新，我们会以公告、应用内弹窗、发送系统消息等通知方式（统称“通知”）就协议的更新向您进行提示。除通知中另有说明外，更新的内容将于协议更新公告公布的生效之日起生效。若您不接受变更后的服务内容或功能，或不同意更新后的协议内容，您需立即停止使用相关服务。若您继续使用本协议项下相关服务的，即视为您已同意我们作出的变更，并自愿接受变更后的协议内容约束。</text>
			<text>1.3、未经监护人同意的情况下，任何未满18周岁的未成年人均不得自行注册账号或使用本服务，我们将依赖您提供的个人信息判断您是否为未成年人。此外，平台不提倡您过度游戏或过度消费，请您在购买前明确自身需求合理范围内理性消费，如果您不具有完全民事行为能力，请在法定监护人（以下简称“监护人”）的陪同下完成阅读和判断是否同意本协议。您点击确认/注册/登陆/授权等按钮并继续使用本服务即视为您已经取得监护人的必要同意。若您在火潮星球明确提示后，您仍然进行了用户注册和产品购买，则视为该用户已经取得了家长或法定监护人的同意或追认，该用户的消费行为应当产生法律效力，并应当承担与 用户相关的法律责任，火潮星球依据本协议及相关法律规定所实施的行为对该用户也具有法律约束力。如果火潮星球发现您是未成年人且未经过监护人的授权或同意，我们将按照法律规定相关约定采取包括但不限于协商索取授权、限制访问暂停服务、注销账户等措施。如有疑问，请提供针对末成年人消费行为未得到合理监管的相关证明，并积极配合平台处理。</text>
			<text>1.4、在您遵守本协议的前提下，火潮星球将给予您一项个人的、不可转让及非排他性的许可，以使用火潮星球软件（以下简称“本软件”）。您可以为非商业目的在单一台终端设备上安装、使用、显示、运行本软件。</text>
			<text>第二条 定义</text>
			<text>2.1、火潮星球平台：指我们开发运营的商品发行、信息展示和交易的平台，包括火潮星球小程序、火潮星球App及其后续我们末来即将开发的其他App、小程序或网站等服务平台。</text>
			<text>2.2、数字藏品：指使用区块链技术进行唯一标识的经数字化的特定虛拟作品、艺术品和商品，包括但不限于数字图片、音频、视频、3D模型等各种形式的虛拟数字藏品。</text>
			<text>2.3、创作者：指创造制作数字藏品的自然人/法人非法人组织。</text>
			<text>2.4、版权方：指依法享有数字藏品所有权并向我们提供版权授权的自然人/法人/非法人组织。</text>
			<text>2.5、发行方：指在本平台发行数字藏品并向您销售和提供数字藏品的自然人/法人/非法人组织。</text>
			<text>2.6、平台规则：指已在或后续将在平台发布的各类规则、规范、公告、说明、解读、声明、指引或其他类似内容，具体以平台实际展示为准。</text>
			<text>第三条 账号注册与管理</text>
			<text>3.1、用户在使用本服务前需要注册一个“火潮星球”账号，需要您提供：手机号/昵称/性别等基础信息进行注册。“火潮星球”账号应当使用手机号码绑定注册，请用户使用尚末与“火潮星球”账号绑定的手机号码，以及未被火潮星球根据本协议封禁的手机号码注册“火潮星球账号。</text>
			<text>3.2、火潮星球可以根据法律法规要求、用户需求或产品需要对账号注册和绑定的方式进行升级或调整，您将于登录页面或登录后的设置页面获取到相关信息。</text>
			<text>3.3、如果注册申请者有被火潮星球封禁的先例或涉嫌虛假注册及滥用他人名义注册，及其他不能得到许可的理由，火潮星球将拒绝其注册申请。</text>
			<text>3.4、注册成功后，用户可以通过“火潮星球”中“我的”-“设置”-界面浏览本人的个人信息。</text>
			<text>3.5、账户所有权：账户的所有权归火潮星球所有。用户完成申请、注册手续后，仅获得该账号的使用权，且该使用权仅属于初始申请注册人。同时，初始申请注册人不得赠与、借用、租用、转让或售卖帐号或者以其他方式许可非初始申请注册人使用帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用帐号。</text>
			<text>3.6、账户的限权：我们有权依据本协议约定或者法律法规的规定对您的账户进行限权或关闭。在限权或关闭账户之前，我们将通知您对账户内的财产（包括账户余额、元气石、个人仓库内所属商品等，下同）进行处置。</text>
			<text>3.7、账户注销：您可以申请注销您的账户。在申请注销账户之前，您需对账户内的数宇藏品进行处置，包括在符合法律法规和交易平台规则的情况下将数字藏品转移至另-账户。如果在您发起注销账户申请之日起六十日之内未能主动对账户内的财产进行处置的，视为您同意自愿放弃对上述财产包括所有权在内的一切权益。我们将在六十日届满之日对财产进行处置。请您注意账户一旦成功注销将不可恢复，即使您在注销后以同一手机号或同一微信、QQ、微博等第三方账号再次在平台注册账户，该账户也将视为新的用户账号，您在原注销账户内的财产将无法被找回，因此请您谨慎操作。</text>
			<text>3.8、您理解并承诺，您所设置的帐号不得违反国家法律法规及本软件使用的相关规则。您设置的帐号名称、头像等信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得用他人名义（包括但不限于冒用他人姓名、名称、字号、头像等足以让人引起混淆的方式）开设帐号。您在帐号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益或有害社会道德风尚的行为。</text>
			<text>3.9、您有义务妥善保管您的帐号，并正确、安全地使用您的帐号，不应把自己的密码透露给其他自然人法人或非法人组织。您对您以服务帐号名义所从事的活动承担全部法律责任，包括但不限于您在本软件进行的任何言论发表、购买、款项支付等操作行为。用户末尽上述义务导致帐号遗失、帐号被盗等情形而给您和他人的民事权利造成损害的，应当自行承担由此产生的法律责任。</text>
			<text>3.10、用户如果遗失自己的登陆密码，需及时通知火潮星球，并按照火潮星球的指导来解决该问题。</text>
			<text>3.11、为保障用户账户安全，用户不得赠与、借用租用、转让或售卖火潮星球账号或者以其他方式许可第三者使用火潮星球账号，否则由此导致的任何法律责任及法律后果均由用户自行承担。</text>
			<text>第四条 平台服务内容</text>
			<text>4.1、数字藏品的服务：指我们以及我们的关联方和合作方基于互联网和区块链，以包括数宇藏品平台在内的各种形态（包括末来技术发展出现的新的服务形态）向您提供的各项服务，包括但不限于以下服务：</text>
			<text>（1）数字藏品的展示、浏览、购买、交易争议处理、订单管理等信息技术服务；</text>
			<text>（2）数字藏品的应用场景相关的应用服务数字藏品的购买：您通过本平台购买或兑换数字藏品，应当是已年满18周岁的中国大陆居民，并且已经通过平台实名身份认证。</text>
			<text>第五条 关于数字藏品服务的说明</text>
			<text>5.1、您有权在平台上享受数宇藏品的浏览、购买、争议处理、订单管理以及数字藏品的访问、欣赏、炫耀、信息查看等信息技术服务，部分数字藏品还可通过平台合作的应用场景进行使用，具体服务内容和功能以平台页面向您实际展示的为准。</text>
			<text>5.2、您可以通过平台浏览不同发行方提供的数字藏品及其相关信息。当您下单购买前，请您务必仔细确认所购买数宇藏品的名称、介绍、发行方、价格、数量及/或其他限制性要求等重要事项，并对是否购买数字藏品做出独立决策和判断。一旦您提交订单，请在规定时限内完成支付。您支付成功后即视为您与发行方之间就已支付价款部分的订单建立了合同关系。特别提醒本平台售出的数宇藏品均为虚拟数字商品，而非实物，且因为区块链技术的特性，本平台售出的数宇藏品不支持退换。</text>
			<text>5.3、基于区块链技术的特性，数字藏品具有加密和不可篡改的特点。一旦上链，数字藏品元数据中的作者、创作时间和上链时间、购买者等信息，在链上无法篡改。您购买相关数宇藏品后，您的购买者信息将记录在数宇藏品的元数据中，作为您持有该数宇藏品的权利凭证。</text>
			<text>5.4、数字藏品的图文展示、介绍、创作者等相关信息均由发行方提供，所有数字藏品的内容和版权由发行方单独承担责任。您应当对通过平台接触到的内容及其准确性、完整性和有效性自行审慎判断并承担由此引起的相应风险。除我们存在故意或重大过失外，我们不对您因前述风险而导致的损失或损害承担责任。</text>
			<text>5.5、为保障您和发行方的交易和资金安全，您同意以微信或平台认可的其他支付方式作为您购买数字藏品的支付工具。您同时授权微信或平台认可的其他支付方式的提供商可以按照发行方和/或我们向您发出的指令为您提供资金结算和支付账户管理等服务。</text>
			<text>5.6、您理解并同意，数宇藏品的版权由发行方或原作创作者拥有。除另行取得版权权利人书面同意外，您不得将数字藏品用于任何商业用途。除平台规则或平台功能允许外，您获得的数宇藏品应仅用于自身收藏、学习、研究、欣赏和展示目的，不得用于任何其他目的。</text>
			<text>5.7、我们严格禁止您利用数字藏品进行售卖、炒作、场外交易、欺诈或以任何其他非法方式进行使用我们保留随时根据业务发展和法律法规政策变化进行调整的杈利。您认可并同意，为了保障交易安全、有序合法以及履行我们反洗钱的义务，我们有权对您的区块链地址进行安全查询。如发现存在售卖、炒作、欺诈等异常行为，或您存在违反法律法规或本协议约定等情形，我们有权对您采取本协议约定的必要措施。</text>
			<text>第六条 充值和支付</text>
			<text>6.1、当您点击充值页面品示的固定充值金额并勾选同意此协议，即可成功充值，成功充值即视为您已阅读、理解，并认同按本协议的相关规定。</text>
			<text>6.2、充值的元气币余额不会过期但不支持转赠他人，请谨慎选择，并确认您的消费需求后再进行充值。</text>
			<text>6.3、用户可以用账户余额来购买“火潮星球”应用中所提供的商品及服务，该商品及服务均由火潮星球与合作商提供。</text>
			<text>6.4、囿于现有技术的限制和网络传输等因素的影响，用户“火潮星球”应用中显示的累计账户余额可能与。</text>
			<text>6.5、如果用户充值账户余额时金额出现错误，用户可以自出现错误之日起7个工作日以内跟火潮星球官方客服联系，核实情况后处理。</text>
			<text>第七条 数字藏品所有权转移</text>
			<text>7.1、您完成关于数宇藏品的订单支付后，平台会按订单的时间顺序，把数宇藏品发送到您的展柜。</text>
			<text>第八条 商品及售后</text>
			<text>8.1、特别提醒本平台售出的数字藏品均为虛拟数字商品，而非实物，且因为区块链技术的特性，本平台售出的数字藏品不支持退换。</text>
			<text>第九条 用户个人隐私信息保护</text>
			<text>火潮星球将仅限于提供基础服务和个性化服务的目的。经过您的同意后，收集/使用/储存您的隐私数据，更多隐私相关规则请您查看《隐私政策》火潮星球未经用户同意不会向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外：1） 法律法规的要求；2）配合司法行政机关的政府行为；3） 取得用户同意。</text>
			<text>第十条 用户使用规范</text>
			<text>10.1、火潮星球用户不能利用火潮星球账号或火潮星球提供的服务进行如下行为，否则我们将对您进行销号处理，并保留追究法律责任的权利：</text>
			<text>(a)用户擅自更改、消除或毁损火潮星球广告业务提供的各种信息；</text>
			<text>(b)利用技术手段批量建立虚假账号；</text>
			<text>(c)侵害火潮星球以及第三者的知识产权；</text>
			<text>(d)提交、发布虛假信息，或盗用他人资料，冒充、利用他人名义；</text>
			<text>(e)传播广告或淫秽、暴力等非法信息；火潮星球服务器端存在统计差异，实际账户余额以服务器端的数据为准。</text>
			<text>(f)其他不遵守本协议的行为；</text>
			<text>(g)如果用户采用擅自更改“火潮星球”应用程序使得该潜在用户虽然安装了“火潮星球”应用但没有正常使用行为的或使用黑客手段攻击火潮星球服务器等不正当手段来获取账户余额，火潮星球视为用户作弊行为而有权取消该用户资格并删除该用户所有账户余额，并保留对攻击火潮星球服务器等黑客行为追究法律责任的权利。</text>
			<text>(h)其他违法以及不正当的行为。</text>
			<text>10.2、除非法律允许或火潮星球书面许可，用户使用本软件过程中不得从事下列行为，否则我们将对您进行销号处理，并保留追究法律责任的权利：</text>
			<text>(a)删除本软件及其副本上展示的关于知识产权相关信息；</text>
			<text>(b)对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；</text>
			<text>(c)对火潮星球拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；</text>
			<text>(d)对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、州除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非火潮星球经授权的第三方工具/服务接入本软件和相关系统；</text>
			<text>(e)通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</text>
			<text>(f)通过非火潮星球开发、授杈的第三方软件、插件、外挂、系统，登录或使用火潮星球软件及服务，或制作发布、传播上述工具；</text>
			<text>(g)自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行千扰；</text>
			<text>(h)其他未经火潮星球明示授权的行为。</text>
			<text>10.3、当火潮星球用户发生如下情况之一时，火潮星球可单方面终止本协议，取消用户继续使用火潮星球产品及服务的资格：</text>
			<text>(a)用户死亡；</text>
			<text>(b)盗用他人的个人信息或手机号；</text>
			<text>(c)注册用户时提供虛假信息；</text>
			<text>(d)以非法手段（包括且不限于黑客攻击等）来积累或使用账户余额；</text>
			<text>(e)妨碍其他用户的正常使用；</text>
			<text>(f)伪称是火潮星球的工作人员或管理人员；</text>
			<text>(g)擅自强行更改火潮星球的计算机系统，或威胁侵入系统；</text>
			<text>(h)擅自传播谣言，用各种手段来毁损火潮星球的名誉与妨碍火潮星球的正常营业；</text>
			<text>(i)利用火潮星球的产品及服务宣传垃圾广告；</text>
			<text>(j)其他违反本协议的行为及违法、犯罪行为。</text>
			<text>10.4、【法律责任】</text>
			<text>(1)您理解并同意：若您违反法律法规、本协议和/或火潮星球其他协议、规则的，火潮星球有杈随时单方根据相应情形采取以下一项或多项措施（具体措施以及采取措施的时间长短由火潮星球根据您的违法、违约情节相应情況确定）：</text>
			<text>(a)对您进行警告；</text>
			<text>(b)删除违法违规信息；</text>
			<text>(c)限制您使用本软件和/或本服务部分或全部功能；</text>
			<text>(d)中止、终止您对相应服务帐号的使用(简称“封号”）</text>
			<text>(e)采取其他合理、合法的措施；</text>
			<text>(f)依法移交有关行政管理机关给予行政处罚，或者依法向有关机关报案追究刑事责任。</text>
			<text>(2)如果您违反法律法规、本协议和/或火潮星球其他协议、规则，火潮星球对您或您使用的本软件和/或本服务采取任何行为或措施后，导致您暂时或永久无法使用服务帐号，您应自行承担相应后果（包括但不限于通信中断、用户资料及相关数据的清空或无法使用等）由此造成您损失的，您应自行承担。</text>
			<text>(3)您导致任何第三方损害的，您应当独立承担责任；火潮星球因此遭受损失的，您也应当一并赔偿.</text>
			<text>10.5.【对自己行为负责】</text>
			<text>您充分了解并同意，您必须为自己使用本平台和/或本服务的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对使用本平台和/或本服务时接触到的内容自行加以判断，包括因对内容的正确性、完整性或实用性的依赖而产生的风险，并承担由此引起的相应风险。火潮星球在法律允许的范围内不对您前述风险而导致的任何损失或损害承担责任。</text>
			<text>第十一条 免责条款</text>
			<text>11.1、火潮星球提供的服务中包括广告，用户同意在使用过程中显示火潮星球与第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害火潮星球不承担任何责任，由交易双方按照法律规定自行处理和解决。</text>
			<text>11.2、用户理解并同意，因用户违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，用户应当独立承担责任；火潮星球因此遭受损失的，用户也应当一并赔偿。</text>
			<text>11.3、用户理解并同意，火潮星球软件同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或者其他恶意程序，威胁用户的终端设备信息和数据安全，继而影响本软件的正常使用等。因此，用户应加强信息安全的保护意识，注意密码保护，以免遭受损失。</text>
			<text>11.4、用户在使用本软件及服务时，须自行承担如下来自火潮星球不可掌控的风险内容，包括但不限于：</text>
			<text>(1)由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；</text>
			<text>(2)用户必须选择与所安装终端设备相匹配的软件版本.否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担；</text>
			<text>(3)用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；</text>
			<text>(4)用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任由用户自行承担；</text>
			<text>(5)由于无线网络信号 不稳定、无线网络带宽不够等原因，所引起的登录失败、资料同步 不完整、页面打开速度慢等风险。</text>
			<text>11.5、因设备维修或更换、故障和通信中断等技术原因以及其他不能预见、不能克服并不能避免且对火潮星球提供服务造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、风暴等以及社会事件如战争、动乱、政府行为等（以下简称“不可抗力”）而中断业务火潮星球可视情况事前或事后通知用户，由此引发的损害及后果，对此火潮星球不承担任何责任。</text>
			<text>11.6、如果因火潮星球临时中断业务而导致用户账户余额数据丢失，火潮星球会给予丢失数据的用户相应的账户余额补偿，具体补偿账户余额金额由火潮星球决定。但因不可抗力导致的业务中断发生时，火潮星球不给予用户补偿，用户对此完全了解并接受，且不持任何异议。</text>
			<text>第十二条知识产权保护</text>
			<text>12.1、深圳红兔文化传媒有限公司是本软件的知识产权权利人。</text>
			<text>12.2、火潮星球的商标、著作权、专利权、商业秘密、广告业务以及所提供的有关广告内容，以及与本软件和服务相关的所有信息内容(包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）的知识产权都归属于火潮星球。</text>
			<text>12.3、用户不经火潮星球的许可不能擅自（包括但不限于）使用、复制、发布、转载、汇编、修改、发表与出版上述知识产权．或通过其他途径获取任何收益等。</text>
			<text>12.4 、我们授予您一项仅限于个人非商业目的、非排他性、可撤销、不可转让、不可分许可的有限的普通许可，您可以在本协议有效期内，按照本协议及平台规则限定的范国和方式使用本平台及相关服务。未经我们另行书面许可，你不得为商业目的下载、安装、登录和使用本软件。本协议未明示授权的其他一切权利仍由我们或相关权利方保留。</text>
			<text>第十三条 其他</text>
			<text>13.1、火潮星球郑重提醒用户注意本协议中免除火潮星球责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。</text>
			<text>13.2、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。</text>
			<text>13.3、本协议的版权由深圳红兔文化传媒有限公司所有，火潮星球保留一切解释和修改的权利。</text>
			<text>13.4、本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</text>
			<text>13.5、本协议末明示授权的其他一切权利仍由火潮星球保留，用户在行使这些权利时须另外取得火潮星球的书面许可。火潮星球如果未行使前述任何权利，并不构成对该权利的放弃。</text>
			<text>13.6、火潮星球有权在必要时修改本协议条款。您可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本软件，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本软件。</text>
			<text>13.7、您理解并同意，出于本服务的业务特性，未经我们书面同意，您不得向第三方转让本协议项下的权利和义务。您进一步同意，在不对您使用本服务造成不利影响的前提下，我们可将在本协议项下的权利和义务全部或部分转让给我们的关联方而无需另行通知或征得您的同意。</text>
			<text>13.8、我们在平台页面展示的最新特别服务说明独立说明/平台规则等构成本协议不可分割的一部分。如果条款之间存在不一致之处，以（1）服务说明、平台规则;（2）本协议的先后顺序进行适用。</text>
			<text>13.9、本协议签订地为中华人民共和国深圳市宝安区。</text>
			<text>13.10、本协议的成立、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</text>
			<text>13.11、若您和火潮星球之间发生任何纠纷或争议首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</text>
		</view>
	</view>
</template>

<script>
import { navigateBack, navigateTo } from '@/shared';
export default {
	data(){
		return {
			holderHeight:0
		}
	},
	onLoad(){
		this.holderHeight = uni.getWindowInfo().statusBarHeight
	},
	methods:{
		goBack() {
			navigateBack();
		},
	}
}
</script>

<style lang="scss" scoped>
	.content{
		width: 100%;
		padding: new-sizing(20);
		text{
			display: block;
			margin-bottom: new-sizing(20);
		}
		.title{
			text-align: center;
			font-size: new-sizing(16);
			font-weight: 600;
		}
		.img{
			width: 100%;
		}
	}
	.header{
		width: 100%;
		position: fixed;
		top: 0;
		z-index: 10;
		background-color: $uni-bg-color;
		.page-header {
			@include flex(row);height: new-sizing(36);
			align-items: center;
			padding: 0 new-sizing(15);
			position: relative;
			background-color: linear-gradient(119.4deg, #87D3FF 13.53%, #99A9FF 65.51%, #3F7CFF 111.38%);
			.back {
				@include flex(row);
				justify-content: center;
				align-items: center;
				.icon {
					width: new-sizing(28);
					height: new-sizing(28);
				}
			}
			.title {
				position: absolute;
				left: 50%;
				top: 50%;
				transform: translate(-50%, -50%);
				.text {
					font-size: new-sizing(18);
					line-height: new-sizing(25);
				}
			}
		}
	}
	.header-holder{
		height: new-sizing(36);
	}
</style>